src/cf/Catalogs/ВидыДокументовФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыДокументовФизическихЛиц</Name>
			<Comment>АПК:413 ОбработкаПолученияДанныхВыбора ради допупорядочивания, допустима история выбора при вводе</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодМВД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ВидыДокументовФизическихЛиц/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт

	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;

КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	// R-ББ 999999
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПаспортСССР";
	Элемент.Наименование = НСтр("ru='Паспорт гражданина СССР'");
	Элемент.КодМВД = "01";
	Элемент.КодПФР = "ПАСПОРТ"; // АПК:1297 не локализуется
	
	// 99 0999999
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЗагранпаспортСССР";
	Элемент.Наименование = НСтр("ru='Загранпаспорт гражданина СССР'");
	Элемент.КодМВД = "02";
	Элемент.КодПФР = "ЗГПАСПОРТ"; // АПК:1297 не локализуется
	
	// R-ББ 999999
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СвидетельствоОРождении";
	Элемент.Наименование = НСтр("ru='Свидетельство о рождении'");
	Элемент.КодМВД = "03";
	Элемент.КодПФР = "СВИД О РОЖД"; // АПК:1297 не локализуется
	
	// ББ 9999990
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УдостоверениеОфицера";
	Элемент.Наименование = НСтр("ru='Удостоверение личности офицера'");
	Элемент.КодМВД = "04";
	Элемент.КодПФР = "УДОСТ ОФИЦЕРА"; // АПК:1297 не локализуется
	
	Элемент = Элементы.Добавить();
	Элемент.Наименование = НСтр("ru='Справка об освобождении из места лишения свободы'");
	Элемент.КодМВД = "05";
	Элемент.КодПФР = "СПРАВКА ОБ ОСВ"; // АПК:1297 не локализуется
	
	// ББ 999999
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПаспортМинморфлота";
	Элемент.Наименование = НСтр("ru='Паспорт Минморфлота'");
	Элемент.КодМВД = "06";
	Элемент.КодПФР = "ПАСПОРТ МОРФЛТ"; // АПК:1297 не локализуется
	
	// ББ 0999999
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВоенныйБилет";
	Элемент.Наименование = НСтр("ru='Военный билет солдата (матроса, сержанта, старшины)'");
	Элемент.КодМВД = "07";
	Элемент.КодПФР = "ВОЕННЫЙ БИЛЕТ"; // АПК:1297 не локализуется
	
	Элемент = Элементы.Добавить();
	Элемент.Наименование = НСтр("ru='Временное удостоверение, выданное взамен военного билета'");
	Элемент.КодМВД = "08";
	Элемент.КодПФР = "ПРОЧЕЕ"; // АПК:1297 не локализуется
	
	// 99 9999999
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДипломатическийПаспорт";
	Элемент.Наименование = НСтр("ru='Дипломатический паспорт гражданина РФ'");
	Элемент.КодМВД = "09";
	Элемент.КодПФР = "ДИППАСПОРТ РФ"; // АПК:1297 не локализуется
	
	Элемент = Элементы.Добавить();
	Элемент.Наименование = НСтр("ru='Паспорт иностранного гражданина'");
	Элемент.КодМВД = "10";
	Элемент.КодПФР = "ИНПАСПОРТ"; // АПК:1297 не локализуется
	
	Элемент = Элементы.Добавить();
	Элемент.Наименование = НСтр("ru='Свидетельство о рассмотрении ходатайства о признании беженцем на территории Российской Федерации по существу'");
	Элемент.КодМВД = "11";
	Элемент.КодПФР = "СВИД БЕЖЕНЦА"; // АПК:1297 не локализуется
	
	Элемент = Элементы.Добавить();
	Элемент.Наименование = НСтр("ru='Вид на жительство в Российской Федерации'");
	Элемент.КодМВД = "12";
	Элемент.КодПФР = "ВИД НА ЖИТЕЛЬ"; // АПК:1297 не локализуется
	
	Элемент = Элементы.Добавить();
	Элемент.Наименование = НСтр("ru='Удостоверение беженца'");
	Элемент.КодМВД = "13";
	Элемент.КодПФР = "УДОСТ БЕЖЕНЦА"; // АПК:1297 не локализуется
	
	Элемент = Элементы.Добавить();
	Элемент.Наименование = НСтр("ru='Временное удостоверение личности гражданина Российской Федерации'");
	Элемент.КодМВД = "14";
	Элемент.КодПФР = "ВРЕМ УДОСТ"; // АПК:1297 не локализуется
	
	Элемент = Элементы.Добавить();
	Элемент.Наименование = НСтр("ru='Разрешение на временное проживание в Российской Федерации'");
	Элемент.КодМВД = "15";
	Элемент.КодПФР = "ПРОЧЕЕ"; // АПК:1297 не локализуется
	
	// ББ-999 9999999
	Элемент = Элементы.Добавить();
	Элемент.Наименование = НСтр("ru='Свидетельство о предоставлении временного убежища на территории Российской Федерации'");
	Элемент.КодМВД = "18";
	Элемент.КодПФР = "ПРОЧЕЕ"; // АПК:1297 не локализуется
	
	// 99 99 9999990
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПаспортРФ";
	Элемент.Наименование = НСтр("ru='Паспорт гражданина РФ'");
	Элемент.КодМВД = "21";
	Элемент.КодПФР = "ПАСПОРТ РОССИИ"; // АПК:1297 не локализуется
	
	// 99 9999999
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЗагранпаспортРФ";
	Элемент.Наименование = НСтр("ru='Загранпаспорт гражданина РФ'");
	Элемент.КодМВД = "22";
	Элемент.КодПФР = "ЗГПАСПОРТ РФ"; // АПК:1297 не локализуется
	
	Элемент = Элементы.Добавить();
	Элемент.Наименование = НСтр("ru='Свидетельство о рождении, выданное уполномоченным органом иностранного государства'");
	Элемент.КодМВД = "23";
	Элемент.КодПФР = "ПРОЧЕЕ"; // АПК:1297 не локализуется
	
	// ББ 9999999
	Элемент = Элементы.Добавить();
	Элемент.Наименование = НСтр("ru='Удостоверение личности военнослужащего Российской Федерации'");
	Элемент.КодМВД = "24";
	Элемент.КодПФР = "ПРОЧЕЕ"; // АПК:1297 не локализуется
	
	// ББ 0999999
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПаспортМоряка";
	Элемент.Наименование = НСтр("ru='Паспорт моряка'");
	Элемент.КодМВД = "26";
	Элемент.КодПФР = "ПАСПОРТ МОРЯКА"; // АПК:1297 не локализуется
	
	// ББ 0999999
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВоенныйБилетОфицераЗапаса";
	Элемент.Наименование = НСтр("ru='Военный билет офицера запаса'");
	Элемент.КодМВД = "27";
	Элемент.КодПФР = "БИЛЕТ ОЗ"; // АПК:1297 не локализуется
	
	Элемент = Элементы.Добавить();
	Элемент.Наименование = НСтр("ru='Иные документы, выдаваемые ОВД'");
	Элемент.КодМВД = "91";
	Элемент.КодПФР = "ПРОЧЕЕ"; // АПК:1297 не локализуется
	
	// БЗКБ
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВодительскоеУдостоверение";
	Элемент.Наименование = НСтр("ru='Водительское удостоверение'");
	Элемент.КодМВД = "";
	Элемент.КодПФР = ""; // АПК:1297 не локализуется
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВременноеУдостоверениеВзаменВоенногоБилетаОфицераЗапаса";
	Элемент.Наименование = НСтр("ru='Временное удостоверение, выданное взамен военного билета офицера запаса'");
	Элемент.КодМВД = "";
	Элемент.КодПФР = ""; // АПК:1297 не локализуется
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СправкаВзаменВоенногоБилета";
	Элемент.Наименование = НСтр("ru='Справка взамен военного билета'");
	Элемент.КодМВД = "";
	Элемент.КодПФР = ""; // АПК:1297 не локализуется
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УдостоверениеГражданинаПодлежащегоПризыву";
	Элемент.Наименование = НСтр("ru='Удостоверение гражданина, подлежащего призыву на военную службу'");
	Элемент.КодМВД = "";
	Элемент.КодПФР = ""; // АПК:1297 не локализуется
	// Конец БЗКБ
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ДанныеВыбораБЗК.ЗаполнитьДляКлассификатораСПорядкомПоДопРеквизиту(
		Справочники.ВидыДокументовФизическихЛиц,
		ДанныеВыбора, Параметры, СтандартнаяОбработка);
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
